Белгипрозем_2017/src/Catalogs/мСметы/мСметы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мСметы</name>
  <owners>Catalog.ВнутренниеДокументы</owners>
  <attributes>
    <name>НомерСметы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.мСостоянияСмет</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРабот</name>
    <type>
      <types>CatalogRef.мОбъектыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>КарточкаОбъектаРабот</name>
    <type>
      <types>CatalogRef.мКарточкиОбъектовРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСметы</name>
    <type>
      <types>CatalogRef.мШаблоныСмет</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасчетаСметы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦен</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Трассировка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Составил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеСметы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.мСтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсвобождениеОтНДС</name>
    <type>
      <types>CatalogRef.мОсвобождениеОтНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстИндексЦен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОбъекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.мВидыРаботЮрЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НаГод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рентабельность</name>
    <type>
      <types>CatalogRef.мРентабельность</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтадииРабот</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтадияРабот</name>
      <type>
        <types>CatalogRef.мСтадииРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <comment>Процент использования таблицы в смете</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаНормВремени</name>
      <type>
        <types>CatalogRef.мТаблицыНормВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Примечания</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтадияРабот</name>
      <type>
        <types>CatalogRef.мСтадииРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>CatalogRef.мПримечанияНормВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаСборник</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентПримечания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрОбъекта</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаНормВремени</name>
      <type>
        <types>CatalogRef.мТаблицыНормВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъемРабот</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтадияРабот</name>
      <type>
        <types>CatalogRef.мСтадииРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаСборник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолонкаТаблицы</name>
      <type>
        <types>CatalogRef.мКолонкиТаблиц</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаТаблицы</name>
      <type>
        <types>CatalogRef.мСтрокиТаблиц</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрКолонки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрСтрокиДляУсловия</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияСтрокиДляУсловия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеКолонки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСтрокиДляУсловия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетСтоимости</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремениНачальная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрСтрокиДляКоличества</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияСтрокиДляКоличества</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСтрокиДляКоличества</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Корреспонденты</name>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Enums/мСостоянияСмет/мСостоянияСмет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мСостоянияСмет</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ВДоговор</name>
    <comment>Смета составлена</comment>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Documents/мСмета/мСмета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мСмета</name>
  <registerRecords>AccumulationRegister.Сметы</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.мВидыРаботЮрЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРабот</name>
    <type>
      <types>CatalogRef.мОбъектыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Смета</name>
    <type>
      <types>CatalogRef.мСметы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Всего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акт</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъемРабот</name>
    <attributes>
      <name>СтадияРабот</name>
      <type>
        <types>CatalogRef.мСтадииРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Catalogs/мСметы/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЭтапДоговора = Неопределено;
	ДатаРасчетаСметы = ТекущаяДата();
	//ИндексЦен = мРаботаСоСметами.ПолучитьИндексЦен(ДатаРасчетаСметы);
	Состояние = Перечисления.мСостоянияСмет.Черновик;
	ДоляОбъекта = 1;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
        Владелец = ДанныеЗаполнения.Владелец;
        Корреспондент = Владелец.Корреспондент;
		Для каждого Заказчик Из Владелец.Корреспонденты Цикл
			НовСтрока = Корреспонденты.Добавить();
			НовСтрока.Корреспондент = Заказчик.Корреспондент;
		КонецЦикла; 
		
		Если ДанныеЗаполнения.Свойство("ЭтапДоговора") Тогда
			// Это из ЭтапаДоговора
			ЭтапДоговора = ДанныеЗаполнения.ЭтапДоговора;
			ОбъектРабот = ЭтапДоговора.ОбъектРабот;
			КарточкаОбъектаРабот = ЭтапДоговора.КарточкаОбъектаРабот;
			СтавкаНДС = ЭтапДоговора.СтавкаНДС;
			ОсвобождениеОтНДС = ЭтапДоговора.ОсвобождениеОтНДС;
			ДоляОбъекта = ЭтапДоговора.ДоляОбъекта;
			
			//Номер сметы
			ЧисловойНомерСметы = мРаботаСоСметами.КоличествоСметЭтапаДоговора(ЭтапДоговора) + 1;
			НомерСметы = СокрЛП(ЭтапДоговора.НомерЭтапа) + "-" + ЧисловойНомерСметы;
		КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
    Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
        Возврат;
	КонецЕсли;
	
	// Регистрация сметы по договору ГКИ
	ДокСметы = НайтиДокСметы(Ссылка);
	
	ЭтоКадастроваяОценка = ВидРабот.Родитель = Справочники.мВидыРаботЮрЛица.КадастроваяОценкаГКИ;
	
	Если НаГод ИЛИ ЭтоКадастроваяОценка Тогда
		// Создать и провести документ мСмета
		Если ЗначениеЗаполнено(ДокСметы) Тогда
			Док = ДокСметы.ПолучитьОбъект();
			Если Док.ПометкаУдаления Тогда
				Док.УстановитьПометкуУдаления(Ложь);
			КонецЕсли; 
		Иначе	
			Док = Документы.мСмета.СоздатьДокумент();
			Док.Дата = Ссылка.ДатаРасчетаСметы;
			Док.УстановитьНовыйНомер();
		КонецЕсли; 
		
		ЗаполнитьЗначенияСвойств(Док, Ссылка);
		Док.Договор = Ссылка.Владелец;
		Док.Смета = Ссылка;
		Док.Сумма = Ссылка.Итого;
		Док.НДС = Ссылка.НДС;
		Док.Всего = Ссылка.КОплате;
		
		Док.ОбъемРабот.Очистить();
		Тз = Док.ОбъемРабот.Выгрузить();
		
		Для каждого Стр Из ОбъемРабот Цикл
			Если Стр.Стоимость > 0 Тогда
				СтрДок = Тз.Добавить();
				СтрДок.СтадияРабот = Стр.СтадияРабот;
				СтрДок.Сумма = Стр.Стоимость;
			КонецЕсли; 
		КонецЦикла; 
		
		Тз.Свернуть("СтадияРабот", "Сумма");
		Док.ОбъемРабот.Загрузить(Тз);
		
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось провести "+ДокСметы);
			Отказ = Истина;			
		КонецПопытки;
	Иначе
		// проверить - не осталось ли док мСмета и удалить его
		Если ЗначениеЗаполнено(ДокСметы) и Не ДокСметы.ПометкаУдаления Тогда
			Попытка
				Док = ДокСметы.ПолучитьОбъект();
				Док.УстановитьПометкуУдаления(Истина);
				Док.Записать();
			Исключение
				Сообщить("Не удалось пометить на удаление "+ДокСметы);
				Отказ = Истина;			
			КонецПопытки; 
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

Функция НайтиДокСметы(Смета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мСмета.Ссылка КАК Смета
		|ИЗ
		|	Документ.мСмета КАК мСмета
		|ГДЕ
		|	мСмета.Смета = &Смета";
	
	Запрос.УстановитьПараметр("Смета", Смета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Смета;		
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции
